In [1]:
import numpy as np
import pandas as pd

# Pandas Basics

https://pandas.pydata.org/docs/user_guide/text.html

## Text Methods for String Data

In [2]:
email = 'abcd@email.com'

In [3]:
email.split('@')

['abcd', 'email.com']

In [4]:
names = pd.Series(['andrew','bobo','claire','david','5'])

In [5]:
names

0    andrew
1      bobo
2    claire
3     david
4         5
dtype: object

In [6]:
names.str.upper()

0    ANDREW
1      BOBO
2    CLAIRE
3     DAVID
4         5
dtype: object

In [7]:
'5'.isdigit()

True

In [8]:
names.str.isdigit()

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [9]:
tech_finance = ['GOOG,APPL,AMZN','JPM,BAC,GS']

In [10]:
len(tech_finance)

2

In [11]:
tickers = pd.Series(tech_finance)

In [12]:
tickers

0    GOOG,APPL,AMZN
1        JPM,BAC,GS
dtype: object

In [13]:
tickers.str.split(',')

0    [GOOG, APPL, AMZN]
1        [JPM, BAC, GS]
dtype: object

In [16]:
tickers.str.split(',').str[0]

0    GOOG
1     JPM
dtype: object

In [17]:
tickers.str.split(',',expand=True)

      0     1     2
0  GOOG  APPL  AMZN
1   JPM   BAC    GS

In [14]:
tech = 'GOOG,APPL,AMZN'

In [15]:
tech.split(',')[0]

'GOOG'

In [18]:
messy_names = pd.Series(['andrew  ',"bo;bo","   claire  "])

In [19]:
messy_names

0       andrew
1          bo;bo
2       claire
dtype: object

In [20]:
messy_names.str.replace(';','').str.strip().str.capitalize()

0    Andrew
1      Bobo
2    Claire
dtype: object

In [21]:
def cleanup(name):
    name = name.replace(";","")
    name = name.strip()
    name = name.capitalize()
    return name

In [22]:
messy_names.apply(cleanup)

0    Andrew
1      Bobo
2    Claire
dtype: object

## Time method for Date and Time Data

https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html

In [23]:
from datetime import datetime

In [24]:
myyear = 2015
mymonth = 1
myday = 1
myhour = 2
mymin = 30
mysec = 15

In [25]:
mydate = datetime(myyear,mymonth,myday)

In [26]:
mydate

datetime.datetime(2015, 1, 1, 0, 0)

In [27]:
mydatetime = datetime(myyear,mymonth,myday,myhour,mymin,mysec)

In [28]:
mydatetime

datetime.datetime(2015, 1, 1, 2, 30, 15)

In [29]:
mydatetime.year

2015

In [30]:
myser = pd.Series(['Nov 3,1990','2000-01-01',None])

In [31]:
myser

0    Nov 3,1990
1    2000-01-01
2          None
dtype: object

In [33]:
timeser = pd.to_datetime(myser)

In [34]:
timeser

0   1990-11-03
1   2000-01-01
2          NaT
dtype: datetime64[ns]

In [35]:
timeser[0].year

1990

In [36]:
obvi_euro_date = '31-12-2000'

In [37]:
pd.to_datetime(obvi_euro_date)

Timestamp('2000-12-31 00:00:00')

In [38]:
euro_date = '10-12-2000'

In [39]:
pd.to_datetime(euro_date,dayfirst=True)

Timestamp('2000-12-10 00:00:00')

In [40]:
style_date = '12--Dec--2000'

In [41]:
pd.to_datetime(style_date,format='%d--%b--%Y')

Timestamp('2000-12-12 00:00:00')

In [42]:
custom_date = "12th of Dec 2000"

In [43]:
pd.to_datetime(custom_date)

Timestamp('2000-12-12 00:00:00')

In [44]:
sales = pd.read_csv('RetailSales_BeerWineLiquor.csv')

In [45]:
sales

           DATE  MRTSSM4453USN
0    1992-01-01           1509
1    1992-02-01           1541
2    1992-03-01           1597
3    1992-04-01           1675
4    1992-05-01           1822
..          ...            ...
352  2021-05-01           6084
353  2021-06-01           6058
354  2021-07-01           6230
355  2021-08-01           5766
356  2021-09-01           5633

[357 rows x 2 columns]

In [46]:
sales['DATE'] = pd.to_datetime(sales["DATE"])

In [47]:
sales['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
352   2021-05-01
353   2021-06-01
354   2021-07-01
355   2021-08-01
356   2021-09-01
Name: DATE, Length: 357, dtype: datetime64[ns]

In [49]:
sales['DATE'][2].year

1992

In [50]:
sales = pd.read_csv('RetailSales_BeerWineLiquor.csv',parse_dates=[0])

In [51]:
sales['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
352   2021-05-01
353   2021-06-01
354   2021-07-01
355   2021-08-01
356   2021-09-01
Name: DATE, Length: 357, dtype: datetime64[ns]

In [52]:
#resampling

sales = sales.set_index("DATE")

In [53]:
sales.resample(rule='A').mean()

            MRTSSM4453USN
DATE
1992-12-31    1807.250000
1993-12-31    1794.833333
1994-12-31    1841.750000
1995-12-31    1833.916667
1996-12-31    1929.750000
1997-12-31    2006.750000
1998-12-31    2115.166667
1999-12-31    2206.333333
2000-12-31    2375.583333
2001-12-31    2468.416667
2002-12-31    2491.166667
2003-12-31    2539.083333
2004-12-31    2682.416667
2005-12-31    2797.250000
2006-12-31    3001.333333
2007-12-31    3177.333333
2008-12-31    3292.000000
2009-12-31    3353.750000
2010-12-31    3450.083333
2011-12-31    3532.666667
2012-12-31    3697.083333
2013-12-31    3803.916667
2014-12-31    3949.583333
2015-12-31    4096.333333
2016-12-31    4271.000000
2017-12-31    4385.166667
2018-12-31    4590.666667
2019-12-31    4733.750000
2020-12-31    5571.000000
2021-12-31    5696.111111

In [54]:
sales = pd.read_csv('RetailSales_BeerWineLiquor.csv',parse_dates=[0])

In [55]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 357 entries, 0 to 356
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   DATE           357 non-null    datetime64[ns]
 1   MRTSSM4453USN  357 non-null    int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 5.7 KB

In [56]:
sales['DATE'].dt.year

0      1992
1      1992
2      1992
3      1992
4      1992
       ...
352    2021
353    2021
354    2021
355    2021
356    2021
Name: DATE, Length: 357, dtype: int64

In [57]:
sales['DATE'].dt.month

0      1
1      2
2      3
3      4
4      5
      ..
352    5
353    6
354    7
355    8
356    9
Name: DATE, Length: 357, dtype: int64